{
  "backend/main.mo": "Empty Motoko canister actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing configuration file updates tied to a relationship start‑date change.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend Valentine-themed components and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining OKLCH color variables, dark mode values, and base styles.",
  "frontend/index.html": "HTML entry point with root div and script loading the main React bundle.",
  "frontend/src/App.tsx": "Composes all Valentine sections, ambient effects, music toggle, and surprise trigger into the main page.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing an authenticated or anonymous backend actor using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and AuthClient behavior.",
  "frontend/src/index.css": "Custom Tailwind theme with romantic color palette, glow utilities, fonts, and reduced‑motion rules.",
  "frontend/src/main.tsx": "React entry point initializing QueryClient, InternetIdentityProvider, and rendering App.",
  "frontend/src/valentine/audio/useBackgroundMusic.ts": "Hook managing global looping background music with play, pause, and volume swell controls.",
  "frontend/src/valentine/components/ambient/GlowBackdrop.tsx": "Renders a glowing radial backdrop that pulses unless reduced-motion is preferred.",
  "frontend/src/valentine/components/ambient/HeartbeatBackdrop.tsx": "Displays a pulsing heartbeat circle animation, disabled when reduced-motion is preferred.",
  "frontend/src/valentine/components/ambient/SparklesLayer.tsx": "Shows animated sparkles drifting upward with staggered timing unless reduced-motion is enabled.",
  "frontend/src/valentine/components/ambient/SunsetBackdrop.tsx": "Creates a gradient sunset-style backdrop with optional slow pulsing animation.",
  "frontend/src/valentine/components/AmbientHearts.tsx": "Renders a canvas with floating animated heart particles unless reduced-motion is preferred.",
  "frontend/src/valentine/components/DaysSinceCounter.tsx": "Displays days elapsed since a configured start date, updating every minute inside a styled Section.",
  "frontend/src/valentine/components/FloatingHeartsLayer.tsx": "Shows floating heart icons that rise with randomized animation timing unless reduced-motion is enabled.",
  "frontend/src/valentine/components/HeartsBurst.tsx": "Creates a burst animation of heart icons radiating outward with randomized angles and distances.",
  "frontend/src/valentine/components/MusicToggle.tsx": "Button that toggles background music playback and updates icon based on state.",
  "frontend/src/valentine/components/PlayfulNoButton.tsx": "A 'No' button that moves away when hovered a few times before showing a playful message.",
  "frontend/src/valentine/components/Section.tsx": "Wraps content in a scroll-reveal animated section using visibility detection.",
  "frontend/src/valentine/components/SurpriseModal.tsx": "Modal component with overlay, escape-key close handling, and scroll locking while open.",
  "frontend/src/valentine/components/SurpriseTrigger.tsx": "Button that opens a SurpriseModal displaying a configured message.",
  "frontend/src/valentine/config.ts": "Defines the relationship start date and the surprise message string.",
  "frontend/src/valentine/hooks/usePrefersReducedMotion.ts": "Hook that tracks the user's prefers-reduced-motion media setting.",
  "frontend/src/valentine/hooks/useScrollReveal.ts": "Hook providing scroll-based visibility detection with IntersectionObserver.",
  "frontend/src/valentine/sections/ClosingSection.tsx": "Final Section component displaying heartfelt closing text and styling.",
  "frontend/src/valentine/sections/FinaleSection.tsx": "Renders the final interactive Valentine section with a YES button that triggers animations, music swell, and a heartfelt message.",
  "frontend/src/valentine/sections/HeroSection.tsx": "Implements the hero section with floating hearts, romantic headings, and a button that smooth-scrolls to the next section.",
  "frontend/src/valentine/sections/PhotoGallerySection.tsx": "Displays a grid of heart-framed gallery images showing romantic moments.",
  "frontend/src/valentine/sections/StorySections.tsx": "Defines multiple themed story sections with ambient backdrops and provided romantic text.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the project.",
  "project_state.json": "Tracks project metadata, requirements, known issues, and architectural notes for the Valentine website."
}